Test/boxTurb16/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p{
    solver GKOCG;tolerance 1e-06; relTol 0.0;smoother none;preconditioner none;minIter 0; maxIter 10000;
    }

    U
    {
        solver          PBiCGStab;
        //solver          GKOBiCGStab;
        preconditioner  none;
        smoother        none;
        tolerance       1e-05;
        minIter         10;
        relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
